P for PureWhite

K for kqp

Z for Zayin

#### A by Z

题意：一个以原点为圆心、半径为 r 的圆，在整点上放 n 个点，求两两距离平方和最大。 r<=30，n<=8

搞一个会 T 的 dp，比如设 f[i,x,y,sx,sy] 表示现在到了 (x,y) 的位置，放了 i 个点，之前的点横坐标和为 sx，纵坐标和为 sy，的最优答案。然后打表。

#### B by P

#### C by Z

#### D by K

题意：给定 n，问是否满足 1^2+2^2+...+n^2 是完全平方数。 n<=1e15

打表发现只有 1 和 24 是满足的。

#### E by K

#### F

#### G by K

题意：给定一个肉架子型的拓扑图，求拓扑序的数量。

先 dp 出一个普通矩形的拓扑序数量，然后第一个矩形倒着 dp，设 f[i,j] 表示第一个矩形上排从右到左到了 i、下排从右到左到了 j 的方案数，普通的转移是个挡板，f[i,i−1]→f[i−1,i−1]→f[i−1,i−2] 特殊地 O(n) 转移一下。（这样的情况只有 n 次，不会 T）

#### H by Z

#### I by Z

#### J by P,Z
